# Ted Bunton
## Week 12 11/12/2020
### Python - Pandas Series

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
s = Series([2,5,7,-9,8,4])

s

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [3]:
s.values

array([ 2,  5,  7, -9,  8,  4], dtype=int64)

In [4]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
# values and index
summer_olympic = Series([2520, 1122, 937, 847, 713],index=['USA', 'Russia', 'Germany', 'UK', 'France'])

summer_olympic

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [6]:
summer_olympic['USA']

2520

In [7]:
summer_olympic[summer_olympic>800]

USA        2520
Russia     1122
Germany     937
UK          847
dtype: int64

In [8]:
'USA' in summer_olympic

True

In [11]:
summer_olympic_dict = summer_olympic.to_dict()

summer_olympic_dict

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'UK': 847, 'France': 713}

In [12]:
#Convert dictionary to Series

summer_olympic_Series = Series(summer_olympic_dict)

summer_olympic_Series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [13]:
countries = ['Russia', 'France', 'Germany', 'USA', 'UK', 'Italy']

In [15]:
#Redefine a Series

s2 = Series(summer_olympic_dict,index=countries)

s2

Russia     1122.0
France      713.0
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [16]:
pd.isnull(s2)

Russia     False
France     False
Germany    False
USA        False
UK         False
Italy       True
dtype: bool

In [18]:
pd.notnull(s2)

Russia      True
France      True
Germany     True
USA         True
UK          True
Italy      False
dtype: bool

In [20]:
summer_olympic_Series + s2

France     1426.0
Germany    1874.0
Italy         NaN
Russia     2244.0
UK         1694.0
USA        5040.0
dtype: float64

In [22]:
s2.name="Summer Olympic"

In [23]:
s2

Russia     1122.0
France      713.0
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [24]:
s2.index.name='Countries'

In [26]:
s2

Countries
Russia     1122.0
France      713.0
Germany     937.0
USA        2520.0
UK          847.0
Italy         NaN
Name: Summer Olympic, dtype: float64

In [27]:
#DataFrame

data_dict = {'states': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 
            'year': [2000, 2001, 2002, 2001, 2002, 2003], 
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

df = pd.DataFrame(data_dict)

df

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
df.tail()

   states  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
pd.DataFrame(data_dict, columns = ['year', 'state', 'pop'])

   year state  pop
0  2000   NaN  1.5
1  2001   NaN  1.7
2  2002   NaN  3.6
3  2001   NaN  2.4
4  2002   NaN  2.9
5  2003   NaN  3.2

In [31]:
df2 = pd.DataFrame(data_dict, columns = ['year', 'state', 'pop', 'debt'],
            index = ['one', 'two', 'three', 'four', 'five', 'six'])

df2

       year state  pop debt
one    2000   NaN  1.5  NaN
two    2001   NaN  1.7  NaN
three  2002   NaN  3.6  NaN
four   2001   NaN  2.4  NaN
five   2002   NaN  2.9  NaN
six    2003   NaN  3.2  NaN

In [32]:
df2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [33]:
df2['state']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: state, dtype: object

In [34]:
df2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [35]:
df2.loc['three']

year     2002
state     NaN
pop       3.6
debt      NaN
Name: three, dtype: object

In [36]:
df2['debt'] = 10.5

df2

       year state  pop  debt
one    2000   NaN  1.5  10.5
two    2001   NaN  1.7  10.5
three  2002   NaN  3.6  10.5
four   2001   NaN  2.4  10.5
five   2002   NaN  2.9  10.5
six    2003   NaN  3.2  10.5

In [37]:
df2['debt'] = np.arange(6.)

df2

       year state  pop  debt
one    2000   NaN  1.5   0.0
two    2001   NaN  1.7   1.0
three  2002   NaN  3.6   2.0
four   2001   NaN  2.4   3.0
five   2002   NaN  2.9   4.0
six    2003   NaN  3.2   5.0

In [38]:
s3 = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [39]:
s3

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [40]:
df2['debt'] = s3

df2

       year state  pop  debt
one    2000   NaN  1.5   NaN
two    2001   NaN  1.7  -1.2
three  2002   NaN  3.6   NaN
four   2001   NaN  2.4  -1.5
five   2002   NaN  2.9  -1.7
six    2003   NaN  3.2   NaN

In [41]:
df2['eastern'] = df2['state'] == 'Ohio'

df2

       year state  pop  debt  eastern
one    2000   NaN  1.5   NaN    False
two    2001   NaN  1.7  -1.2    False
three  2002   NaN  3.6   NaN    False
four   2001   NaN  2.4  -1.5    False
five   2002   NaN  2.9  -1.7    False
six    2003   NaN  3.2   NaN    False

In [42]:
df.columns

Index(['states', 'year', 'pop'], dtype='object')

In [44]:
#nested dictionary

pop_dict = {'Nevada': {2001: 2.4, 2002: 2.9},
           'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

pop_dict

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [45]:
df3 = pd.DataFrame(pop_dict)

df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [46]:
df3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [47]:
pd.DataFrame(df3, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [48]:
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [49]:
df3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [50]:
df3['Ohio'][:2]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [51]:
df3['Nevada'][:1]

2001    2.4
Name: Nevada, dtype: float64